OSCCAR/tutorials/K1MET/steelMaking/tundish/newtownianSinglePhaseTracerTundish/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-500       0  0) //  0
    (-366.67    0  0) //  1
    (-350       0  0) //  2
    ( 350       0  0) //  3
    ( 350    -100  0) //  4
    ( 366.67 -100  0) //  5
    ( 366.67    0  0) //  6
    ( 500       0  0) //  7
    ( 600     370  0) //  8
    ( 440     370  0) //  9
    ( 420     370  0) // 10
    (-420     370  0) // 11
    (-420     470  0) // 12
    (-440     470  0) // 13
    (-440     370  0) // 14
    (-600     370  0) // 15    

    (-500       0 10) // 16
    (-366.67    0 10) // 17
    (-350       0 10) // 18
    ( 350       0 10) // 19
    ( 350    -100 10) // 20
    ( 366.67 -100 10) // 21
    ( 366.67    0 10) // 22
    ( 500       0 10) // 23
    ( 600     370 10) // 24
    ( 440     370 10) // 25
    ( 420     370 10) // 26
    (-420     370 10) // 27
    (-420     470 10) // 28
    (-440     470 10) // 29
    (-440     370 10) // 30
    (-600     370 10) // 31    
);

blocks
(
    hex (0 1 14 15 16 17 30 31) (16 37 1) simpleGrading (1 1 1)
    hex (1 2 11 14 17 18 27 30) (2 37 1) simpleGrading (1 1 1)
    hex (2 3 10 11 18 19 26 27) (84 37 1) simpleGrading (1 1 1)
    hex (3 6 9 10 19 22 25 26) (2 37 1) simpleGrading (1 1 1)
    hex (6 7 8 9 22 23 24 25) (16 37 1) simpleGrading (1 1 1)
    hex (14 11 12 13 30 27 28 29) (2 10 1) simpleGrading (1 1 1) // inlet pipe
    hex (4 5 6 3 20 21 22 19) (2 10 1) simpleGrading (1 1 1) // outlet pipe
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 13 29 28)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (4 5 21 20)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 16 31 15) // left wall

            (0 1 17 16) // bottom left
            (1 2 18 17) // bottom second from left
            (2 3 19 18) // bottom middle
            (6 7 23 22) // bottom right

            (3 4 20 19) // left wall outlet pipe
            (5 6 22 21) // right wall outlet pipe
            
            (7 8 24 23) // right

            (14 15 31 30) // top left
            (10 11 27 26) // top middle
            (9 10 26 25) // top second right
            (8 9 25 24) // top right

            (13 14 30 29) // inlet pipe left wall
            (11 12 28 27) // inlet pipe right wall
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
