OSCCAR/tutorials/K1MET/steelMaking/tundish/newtownianSinglePhaseTracerTundish/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          2;
        startFace       8783;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       8785;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350;
        startFace       8787;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8960;
        startFace       9137;
    }
)

// ************************************************************************* //
