OSCCAR/tutorials/K1MET/steelMaking/tundish/newtownianSinglePhaseTracerTundish/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

cp -r 0.org 0 > /dev/null 2>&1

runApplication $(getApplication)


# ----------------------------------------------------------------- end-of-file
